server/plugins/rorplacos/app/controllers/sensors_controller.rb

SELECT `sensors`.* FROM `sensors` WHERE (`sensors`.device_id = 2) LIMIT 1
---
  def index
    path = '/'+ params[:path] ||= ""
    @connexion = Opos_Connexion.instance

    if @connexion.readable?(path,session[:user]) # if sensor is readable
      @sensor = Sensor.new(@connexion,path)

      respond_to do |format|
        format.html # index.html.erb
        format.json  { render :json => @sensor.value}